#!/bin/bash

function Help()
{
	echo +-------------------------------------------------------------------------------------------------------------------+
	echo \| Вызов:\ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \|
	echo +-------------------------------------------------------------------------------------------------------------------+
	echo \| "C:\Users\artem\OneDrive\Рабочий стол\lab4.sh" \{sourceFolder\} \{destinationFile\} \[param1\] \[param2\] \[param3\] ...\ \ \ \ \ \ \|
	echo +-------------------------------------------------------------------------------------------------------------------+
	echo \| Параметры:\ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \|
	echo +--------------------------------+----------------------------------------------------------------------------------+
	echo \| \{sourceFolder\}\ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \| папка-источник \(обязательно\)\ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \|
	echo \| \{destinationFile\}\ \ \ \ \ \ \ \ \ \ \ \ \ \ \| файл-отчёт \(обязательно\)\ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \|
	echo \| \[param1\] \[param2\] \[param3\] ... \| переменное число параметров-расширений \(необязательно\)\ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \|
	echo +--------------------------------+----------------------------------------------------------------------------------+
	echo \| Описание:\ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \|
	echo +-------------------------------------------------------------------------------------------------------------------+
	echo \| Пользователь задаёт в качестве параметров путь к папке с файлами,\ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \|
	echo \| путь к файлу с отчётом и произвольное количество расширений файлов через пробел.\ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \|
	echo \| В результирующий файл записывается отчёт вида:\ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \|
	echo \| Формат 1 - Количество файлов\ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \|
	echo \| Формат 2 - Количество файлов\ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \|
	echo \| ...\ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \|
	echo +-------------------------------------------------------------------------------------------------------------------+

	
}

function DoWork()
{
	sourceFolder=$1
	destinationFile=$2

	shift; shift

	
	
	sourceFolder+="/*"
	extensions=$*

	for ext in $extensions; do
		count=0
		for file in $sourceFolder; do
			curExt="${file: -4}"
			if [ "$curExt" = "$ext" ]; then
				count=$(( $count + 1 ))
			fi
		done
		
		echo "Формат $ext - $count" >> $destinationFile
	done
}


sourceFolder=$1
destinationFile=$2

if [ "$1" = "--help" ]; then
	Help
elif [ "$1" = "" ]; then
	echo "Два параметра обязательны!"

	echo -n "Введите путь к папке-источнику: "
	read sourceFolder

	while [ ! -d $sourceFolder ]; do
		echo "$sourceFolder не папка!"
		echo -n "Введите путь к папке-источнику: "
		read sourceFolder
	done

	echo -n "Введите путь к файлу-отчёту: "
	read destinationFile

	if [ ! -e "$destinationFile" ]; then
		touch $destinationFile
	fi

	while [ ! -f $destinationFile ]; do
		echo "$destinationFile не может быть файлом-отчётом!"
		echo -n "Введите путь к файлу-отчёту: "
		read destinationFile
	done

elif [ "$2" = "" ]; then
	echo "Два параметра обязательны!"

	echo -n "Введите путь к файлу-отчёту: "
	read destinationFile

	if [ ! -e "$destinationFile" ]; then
		touch $destinationFile
	fi

	while [ ! -f $destinationFile ]; do
		echo "$destinationFile не может быть файлом-отчётом!"
		echo -n "Введите путь к файлу-отчёту: "
		read destinationFile
	done
fi

if [[ "$3" = "" && "$1" != "--help" ]]; then
	echo "Не указано ни одного расширения файла!"
	yes="y"
	extensions=""
	while [ "$yes" = "y" ]; do
		
		echo -n "Введите расширение: "
		read ext
		extensions+="${ext} "
		echo -n "Добавить расширение? (y/n) "
		read yes
	done
else
	shift; shift
	extensions=$*

fi

DoWork $sourceFolder $destinationFile $extensions